InformationRegisters/ОчередьЗаказовККорректировкеСтрокМерныхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОчередьЗаказовККорректировкеСтрокМерныхТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьЗаказовККорректировкеСтрокМерныхТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет запись в регистр.
//
// Параметры:
//  ЗаказСсылка  - ДокументСсылка - Ссылка на заказ для добавления.
//
Процедура ДобавитьЗаказВОчередь(ЗаказСсылка, Регистратор = Неопределено) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Метаданные.РегистрыСведений.ОчередьЗаказовККорректировкеСтрокМерныхТоваров.Измерения.Заказ.Тип.СодержитТип(ТипЗнч(ЗаказСсылка)) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьЗаказовККорректировкеСтрокМерныхТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Заказ",ЗаказСсылка);
	Блокировка.Заблокировать();
	
	МенеджерЗаписи = РегистрыСведений.ОчередьЗаказовККорректировкеСтрокМерныхТоваров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заказ = ЗаказСсылка;
	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Выбран() Тогда
		Возврат;
	Иначе
		МенеджерЗаписи.Заказ          = ЗаказСсылка;
		МенеджерЗаписи.ДатаДобавления = ТекущаяДатаСеанса();
		
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			
			Если ЗначениеЗаполнено(Регистратор) Тогда
				ТекстСообщения = НСтр("ru='Не удалось выполнить проведение документа: %Ссылка% по причине: %Причина%';uk='Не вдалося виконати проведення документа: %Ссылка% по причині: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Регистратор);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка, Регистратор.Метаданные(), Регистратор, ТекстСообщения);
			Иначе
				ТекстСообщения = НСтр("ru='Не удалось добавить в очередь корректировки строк мерных товаров заказ %Заказ%';uk='Не вдалося додати в чергу коригування рядків мірних товарів замовлення %Заказ%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Заказ%", ЗаказСсылка);
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			КонецЕсли;
			
			ВызватьИсключение;
			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
